1:Badges
00000429

Novice Crafter 
00000430

Apprentice Crafter
00000431

Initiate Crafter
00000432

Adept Crafter
00000433

Master Artisan
00000434

Complete the Apprentice Crafting Quest
00000435

Bookworm
00000436

Libraries
00000437

Shop Visits
00000438

<image;Pet_Sergeant> Pet Sergeant
00000439

<image;Pet_Veteran> Pet Veteran
00000440

<image;Pet_Knight> Pet Knight
00000441

<image;Pet_Captain> Pet Captain
00000442

<image;Pet_Commander> Pet Commander
00000443

<image;Pet_Warlord> Pet Warlord
00000444

Grandmaster Artisan
00000445

Spiral Geographer
00000446

Shark Catcher
00000447

Defeat 50 Sharks
00000448

Sharks
00000449

Defeat 50 Sharks
00000450

Shark Fisher
00000451

Defeat 100 Sharks
00000452

Shark Jumper
00000453

Defeat 200 Sharks
00000454

Crab Chaser
00000455

Crab Tackler
00000456

Crab Angler
00000457

Defeat 200 Crabs
00000458

Defeat 100 Crabs
00000459

Defeat 50 Crabs
00000460

Crabs
00000461

Master Angler
00000462

Astrologist
00000463

Defeat the Sun, Moon, and Stars Bosses
00000464

Celestian Explorer
00000465

Complete Lounging Lizards
00000466

Grizzleheim Explorer
00000467

Find all the Yard Birds
00000468

Briskbreeze Champion
00000469

Bear Bouncer
00000470

Defeat 50 Bears
00000471

Bears
00000472

Unbearable
00000473

Defeat 100 Bears
00000474

Defeat 200 Bears
00000475

Bird Watcher
00000476

Ravens
00000477

Defeat 50 Ravens
00000478

Bird Beguiler
00000479

Defeat 100 Ravens
00000480

Ravens
00000481

Bird is the Word
00000482

Defeat 200 Ravens
00000483

Ravens
00000484

Nordic Champion
00000485

Finish all Grizzleheim quests
00000486

Wintertusk Explorer
00000487

Complete Find the Troggs
00000488

Hero of Grizzleheim
00000489

Complete Grizzleheim North
00000490

Triton Underwater Hero
00000491

Defeat Triton Underwater Boss
00000492

Waterworks Warrior
00000493

Defeate Triton Underwater Boss
00000494

Master Historian
00000495

Complete All Book Quests
00000496

Bear Blaster
00000497

Defender of the People
00000498

Defeat all bosses
00000499

Plant Purifier
00000500

Defeat 50 Plants
00000501

Defeat 100 Plants
00000502

Weed Whacker
00000503

Defeat 250 Plants
00000504

Goblin Gobbler
00000505

Defeat 50 Goblins
00000506

Goblin Smasher
00000507

Defeat 100 Goblins
00000508

Napoleon Complex
00000509

Defeat 250 Goblins
00000510

Wysteria Explorer
00000511

Complete the Wallflowers
00000512

Defeat Lord Bramble
00000513

Liberator of the Helephant
00000514

A+ Student
00000515

Finish all of Wysteria
00000516

Hero of Pegasus Place
00000517

Finish Pegasus Place
00000518

Plant Liberator
00000519

Plants
00000520

Plants
00000521

Plants
00000522

Goblins
00000523

Goblins
00000524

Goblins
00000525

Lion Leaper
00000526

Defeat 50 Lions
00000527

Lions
00000528

Lion Tamer
00000529

Defeat 100 Lions
00000530

Lions
00000531

Lions
00000532

Defeat 250 Lions
00000533

Ruler of the Jungle
00000534

Elephant Tracker
00000535

Defeat 50 Elephants
00000536

Elephants
00000537

Elephant Tamer
00000538

Defeat 100 Elephants
00000539

Elephants
00000540

White Elephant
00000541

Defeat 250 Elephants
00000542

Elephants
00000543

Hero of Zafaria
00000544

Finish all of Zafaria
00000545

Zafarian Explorer
00000546

Finish The Monkeys
00000547

Test Badge
00000548

Grandmaster Gardener
00000549

Grandmaster Gardener
00000550

Grandmaster Gardener
00000551

Grandmaster Gardener
00000552

Legendary Gardener
00000553

Legendary Gardener
00000554

Weirwood Walker
00000555

Defeat 50 Deer
00000556

Deer
00000557

Savage Hunter
00000558

Defeat 100 Deer
00000559

Deer
00000560

Master of the Wild Hunt
00000561

Defeat 200 Deer
00000562

Deer
00000563

Presser of Froudlings
00000564

Defeat 50 Froudlings
00000565

Froudlings
00000566

Fiend of the Froudlings
00000567

Defeat 100 Froudlings
00000568

Froudlings
00000569

Cold Iron Warrior
00000570

Defeat 200 Froudlings
00000571

Froudlings
00000572

Squire
00000573

Armiger
00000574

Knight Errant
00000575

Knight of the Wyrd
00000576

Knight of the Silver Rose
00000577

Avalon Explorer
00000578

Finish Crowology
00000579

Hero of Avalon
00000580

Finish all of Avalon
00000581

One in a Million
00000582

Master of Karate and Friendship
00000583

Fighter of the Night man
00000791

Beast Master
00000936

Ninja Master
00000963

Aztecosaur Hunter
00000964

Defeat 50 Parasaurs
00000965

Parasaurs
00000966

Paleontologist
00000967

Defeat 100 Parasaurs
00000968

Scourge of the Scales
00000969

Defeat 200 Parasaurs
00000970

Dino Hunter
00000971

Defeat 50 Raptors
00000972

Raptors
00000973

Dino Trapper
00000974

Defeat 100 Raptors
00000975

Dino Devastator
00000976

Defeat 200 Raptors
00000977

Prehistoric Pugilist
00000978

Defeat 50 Tritops
00000979

Tritops
00000980

Primeval Purger
00000981

Defeat 100 Tritops
00000982

Primordial Foe
00000983

Defeat 200 Tritops
00000984

Azteca Explorer
00000985

Finish The UFOs
00000986

Lord of the Falling Sky
00000987

Finish Comet Xibalba
00000988

Ward Against Blight
00000989

Finish Wilting Flowers
00000990

Master of the Jungle
00000991

Finish all of Azteca
00000992

Transcendent Crafter
00000993

Lady of the Falling Sky
00000998

<image;Pet_Sergeant> 1st Age Pet Sergeant
00000999

<image;Pet_Veteran> 1st Age Pet Veteran
00001000

<image;Pet_Knight> 1st Age Pet Knight
00001001

<image;Pet_Captain> 1st Age Pet Captain
00001002

<image;Pet_Commander> 1st Age Pet Commander
00001003

<image;Pet_Warlord> 1st Age Pet Warlord
00001024

Author of Virtue's Poetry 
00001025

Quiet Writer of Epitaphs
00001026

Scribe of the Howlin' Wind
00001027

Bleak Master of the Pen
00001028

Coruscating Calligrapher
00001029

Cipher of Lost Glyphs
00001030

Illuminator of the Lost Pages
00001061

Get 5000 total points in PvP Tournaments
00001062

Tournament Points
00001063

Get 25000 total points in PvP Tournaments
00001064

Get 1 PVP Tournament wins
00001065

Tournament Wins
00001066

Get 10 PVP Tournament wins
00001123

Notorious Dueler
00001124

Blooded Battler
00001125

Formidable Scrapper
00001126

Acclaimed Brawler
00001149

Warrior of Winterbane
00001150

Grendel Slayer
00001171

Honorable Bronze Archon
00001172

Supreme Gladiator
00001173

Valorous Silver Archon
00001174

Wave Tamer
00001175

Glorious Golden Archon
00001176

Bearer of the Silver Sickle
00001301

Council of Light Adherent
00001302

Elixir Vitae
00001303

Council of Light Adherent
00001304

Bee Swatter
00001319

Kill 100 Spider Mages
00001320

Mantis Tamer
00001321

Fifth Column Seer
00001322

Last Rites
00001323

Webslinger
00001324

Umbra Slayer
00001325

Bane of the Arachna
00001326

Doombreaker
00001327

General of Light
00001328

Journeyman Shadowmancer
00001329

Promethean Crafter
00001330

Royal Entomologist
00001331

Promethean Crafter
00001332

Promethean Crafter
00001341

Spiral Cup Tutor
00001365

Bass Master
00001366

Honest Angler
00001367

GONE FISHIN'
00001368

Rock Hero
00001369

Constant Gardener
00001370

Blackthorn's Favorite
00001371

Flower Power
00001372

Team Player
00001373

Team Leader
00001374

Dragonspyre Angler
00001375

Complete DS-FISH-C01-003
00001376

Fisher #-1:$TITLEGENDER$#-1:{King[m] | Queen[f]}
00001377

Teams Helped
00001414

Spell Checker
00001415

Defeat 50 Spellwrit Mobs
00001416

Spellwrit Mobs
00001417

Spell Writer
00001418

Defeat 250 Spellwrit Mobs
00001419

Bone Rattler
00001420

Defeat Ultra Dungeon Rattlebones
00001421

UltraDungeon
00001422

Bone Grinder
00001423

Defeat Ultra Dungeon Rattlebones x10
00001424

Krokopatra's Bane
00001425

Defeat Ultra Dungeon Krokopatra
00001426

Krok Queen Quasher
00001427

Defeat Ultra Dungeon Krokopatra x10
00001428

Gumshoe
00001429

Defeat Ultra Dungeon Meowiarty x10
00001430

Defeat Ultra Dungeon Meowiarty
00001431

Champion of the Sky
00001432

Defeat Ultra Dungeon Zeus
00001433

Immortal Conqueror
00001434

<image;Pet_Sergeant> 2nd Age Pet Sergeant
00001435

<image;Pet_Veteran> 2nd Age Pet Veteran
00001436

<image;Pet_Knight> 2nd Age Pet Knight
00001437

<image;Pet_Captain> 2nd Age Pet Captain
00001438

<image;Pet_Commander> 2nd Age Pet Commander
00001439

<image;Pet_Warlord> 2nd Age Pet Warlord
00001440

Super Sleuth
00001441

2nd Age Notorious Dueler
00001442

2nd Age Blooded Battler
00001443

2nd Age Formidable Scrapper
00001444

2nd Age Acclaimed Brawler
00001445

Rattlebones
00001446

Zeus
00001447

Krokopatra
00001448

Meowiarty
00001451

Complete the quest "Too Cold, Too Cold"
00001452

Polaris Explorer
00001453

Revolutionary Dancer
00001454

Complete the quest "Dance Revolution"
00001455

Hero of the Basstille
00001456

Complete the quest "Storming the Basstille"
00001457

Patriôte Paragon
00001458

Complete the quest "The Empress and the Rat"
00001459

Complete the quest "Pièce de Résistance!"
00001460

Assistant to the Master Artist
00001461

Polarian Rose Picker
00001462

Complete the quest "Plotting out Polar Roses"
00001463

Ravenwood Alumnus
00001464

Complete the quest "Pomp and Circumstance"
00001465

Defender of Land & Sky
00001466

Complete the quest "Saving the Sky Anchor"
00001467

Benevolent Savage
00001468

Complete the quest "Save the Wailers"
00001469

Reddín's Redemption
00001470

Complete the quest "...Or Get Busy Dying"
00001471

Warden of Walruskberg
00001472

Complete all Walruskberg & Harbor tasks
00001473

Arcanum Initiate
00001474

Complete the quest "Arcanum Initiation"
00001475

Wizard101 Excelsior
00001476

Reach level 101 in Wizard101
00001477

Simon's Bane
00001478

Gravulum Adept
00001479

Ixnay on the Ixcax
00001480

Reading Room Roustabout
00001481

Omen's Adversary
00001482

Phantom's Menace
00001483

Cutter's Bane
00001484

In'Zhizor's Undoing
00001485

Caged the Elephant
00001486

Bunferatu's Downfall
00001487

Master of the Masterless
00001488

Lambent's Damper
00001515

Defeat 50 House Purrzian Assailants
00001516

Defeat 100 House Purrzian Assailants
00001517

Defeat 100 Sand Sand Wurm Larva
00001518

Return 100 Antiquities
00001519

Defeat 50 Boas
00001520

Defeat 100 Boas
00001521

Defeat 50 Serpentine Vipers
00001522

Defeat 50 Ghultures
00001523

Defeat 50 Trengils
00001524

Defeat 50 Conscripts
00001525

Defeat 100 Bumbai Rebels
00001526

Defeat 50 Bumbai Rebels
00001527

Defeat 100 Sandwitches
00001528

Defeat 50 Sandwitches
00001529

Defeat 50 Djinn
00001530

Defeat 100 Djinn
00001531

Defeat 50 House Calixco Guards
00001532

Defeat 100 House Calixco Guards
00001533

Defeat 50 Ferals, Thuggies, or Fangs Gang Members.
00001534

Defeat 100 Ferals, Thuggies, or Fangs Gang Members.
00001535

Return 50 Antiquities
00001536

Savior of the Sands
00001537

Arcanum Understudy
00001538

Vipers' Bane
00001539

Calixco Commando
00001540

Unconstrictable
00001541

Boa Bruiser
00001542

Eye of the Tiger
00001543

Conscript Crusher
00001544

Ghultures' Bane
00001545

Trengil Thrasher
00001546

Archaeologist
00001547

Treasure Hunter
00001548

Aggrobah Enforcer
00001549

Aggrobah Sheriff
00001550

Serpentine Scout
00001551

Serpentine Avenger
00001552

Sayameez Sergeant
00001553

Rebellion Crusher
00001554

Dunes Marshal
00001555

Sandwitches' Scourge
00001556

Dunes Warrior
00001557

Dunes Veteran
00001558

Tabbi Soldier
00001559

Tabbi General
00001560

Caterwaul Conscript
00001561

Wurmslayer
00001562

Return 100 Antiquities
00001563

Champion Crafter
00001566

Fantastic Voyager
00001567

Complete the quest "Midday At The Oasis"
00001568

Mirage Explorer
00001569

Complete the quest "Cactus Blossom Boogie"
00001570

Cactus Blossom Enthusiast
00001571

Mimic Muter
00001572

Hockins' Hex
00001573

Sapoti's Savior
00001574

<image;Pet_Commander> 3rd Age Pet Commander
00001575

<image;Pet_Knight> 3rd Age Pet Knight
00001576

<image;Pet_Sergeant> 3rd Age Pet Sergeant
00001577

<image;Pet_Veteran> 3rd Age Pet Veteran
00001578

<image;Pet_Warlord> 3rd Age Pet Warlord
00001579

3rd Age Acclaimed Brawler
00001580

3rd Age Formidable Scrapper
00001581

3rd Age Blooded Battler
00001582

3rd Age Notorious Dueler
00001583

<image;Pet_Captain> 3rd Age Pet Captain
00001603

Team Manager
00001604

Team Champion
00001625

Alphoi Assassin
00001626

Defeat 50 Alphoi
00001627

Defeat 100 Alphoi
00001628

Alphoiled Again!
00001629

Beast Basher
00001630

Defeat 50 Beastmen
00001631

Best of the Beasts
00001632

Defeat 100 Beastmen
00001633

Dwarf Dasher
00001634

Defeat 50 Dwarves
00001635

Mighty Dwarven Power Rager
00001636

Defeat 100 Dwarves
00001637

Kalamarvellous!
00001638

Defeat 50 Kalamar
00001639

Defeat 100 Kalamar
00001640

Kalamagnificent!
00001641

Glob Trotter
00001642

Defeat 50 Globulin
00001643

Arthropwned!
00001644

Defeat 50 Hornets
00001645

Anti-Spawner
00001646

Defeat 50 Frost or Lava Spawn
00001647

Brain Teaser
00001648

Defeat Medulla 100 times
00001649

Complete the quest "The Blowfish"
00001650

Empyrea Explorer
00001651

Crown Sourcer
00001652

Complete the quest "Turn That Crown Upside Down"
00001653

Only Mostly Done
00001654

Complete the quest "Brain Drain"
00001655

Sideline Directive
00001656

Complete all Empyrea Part 1 Side Quests
00001657

Visionary Crafter
00001658

Revered Crafter
00001659

Succeed at the Zanadu Dance Game
00001660

Shiny Dancer
00001661

Lord of the Dance
00001662

Succeed at the Lava Lock game in Athanor
00001663

Pipe Perfect
00001664

Let the Beasts Drop
00001665

Defeat Beastman Fight Club once.
00001666

Fight for Your Right
00001667

Defeat Beastman Fight Club ten times.
00001668

Badge to Ill
00001669

Defeat Beastman Fight Club one hundred times.
00001670

Beet Boxer
00001671

Allow the Beastie Boys to "drop a beet" and then win the fight.
00001685

Spawn-B-Gone
00001686

Defeat 100 Frost or Lava Spawn
00001687

New Pet Owner
00001688

Rookie Pet Owner
00001689

Proud Pet Owner
00001690

Master Pet Enthusiast
00001691

Promethean Pet Enthusiast
00001692

Champion Pet Enthusiast
00001693

Master Pet Collector
00001694

Promethean Pet Collector
00001695

Champion Pet Collector
00001696

Master Pet Wrangler
00001697

Promethean Pet Wrangler
00001698

Champion Pet Wrangler
00001699

Master Pet Tamer
00001700

Promethean Pet Tamer
00001701

Champion Pet Tamer
00001702

Master Pet Trainer
00001703

Promethean Pet Trainer
00001704

Champion Pet Trainer
00001705

Master Pet Lover
00001706

Promethean Pet Lover
00001707

Champion Pet Lover
00001708

Master Pet Expert
00001709

Promethean Pet Expert
00001710

Champion Pet Expert
00001711

Master Pet Virtuoso
00001712

Promethean Pet Virtuoso
00001713

Champion Pet Virtuoso
00001714

Master Pet Hero
00001715

Promethean Pet Hero
00001716

Champion Pet Hero
00001717

Master Pet Scholar
00001718

Promethean Pet Scholar
00001719

Champion Pet Scholar
00001720

Master Pet Sage
00001721

Promethean Pet Sage
00001722

Champion Pet Sage
00001723

Master Petologist
00001724

Promethean Petologist
00001725

Champion Petologist
00001726

Master Petmancer
00001727

Promethean Petmancer
00001728

Champion Petmancer
00001729

Initiate Hatchmaker
00001730

Used Hatchmaking System
00001731

Adept Hatchmaker
00001732

Superior Hatchmaker
00001733

Grandmaster Hatchmaker
00001734

Collected Pets
00001735

Pets Hatched
00001776

Position Coach
00001777

Win 10 Whirly Burly matches
00001778

Games Won
00001779

Win 50 Whirly Burly matches
00001780

Assistant Coach
00001781

Win 100 Whirly Burly matches
00001782

Head Coach
00001783

Brain Buster
00001784

Defeat Medulla 1000 times
00001785

Hero of Light and Shadow
00001786

Complete the quest "Nothing to Fear"
00001787

Complete all Empyrea Part 2 Side Quests
00001788

Empyrean Adventurer
00001789

Scion of Bartleby
00001790

Become the Scion of Bartleby
00001791

Communications Officer
00001792

Finish the Communications Officer Quest
00001793

Stormbreaker
00001794

Defeat the Storm Titan
00001795

Storm Chaser
00001796

Defeat the Storm Titan 100 times
00001797

Divine Paradox
00001798

Defeat the Aethyr Titan
00001799

Brain Basher
00001804

Dispeller of Ignorance
00001805

Aethyr Eater
00001806

Balance Deckathelon Medalist
00001807

Cyclops Rank 001
00001808

Got Cyclops Rank 1
00001809

Gravulum Magus
00001810

Do the Daily Assignment for 15 days
00001811

You did the Daily Assignment for 15 days!
00001812

Grumpy Warlord
00001813

Grumpy Gobbler Courses
00001814

Successfully clear 100 Grumpy Gobbler courses
00001815

Grumpy Governor
00001816

Successfully clear 150 Grumpy Gobbler courses
00001817

Campaigner
00001818

Successfully clear 50 Grumpy Gobbler courses
00001819

Ice Colossus
00001820

Ice Colossus II
00001821

Ice Colossus III
00001822

Ice Colossus IV
00001823

Ice Colossus V
00001824

Balance Cyclops
00001825

Balance Cyclops III
00001826

Balance Cyclops IV
00001827

Balance Cyclops V
00001828

Storm Wolf Warrior
00001829

Storm Wolf Warrior II
00001830

Storm Wolf Warrior III
00001831

Storm Wolf Warrior IV
00001832

Storm Wolf Warrior V
00001833

Fire Minotaur
00001834

Fire Minotaur III
00001835

Fire Minotaur IV
00001836

Fire Minotaur V
00001837

Ice Krokomummy
00001838

Ice Krokomummy II
00001839

Ice Krokomummy III
00001840

Ice Krokomummy IV
00001841

Ice Krokomummy V
00001842

Death Ninja Pig
00001843

Death Ninja Pig II
00001844

Death Ninja Pig III
00001845

Death Ninja Pig IV
00001846

Death Ninja Pig V
00001847

Fire Elf
00001848

Fire Elf II
00001849

Fire Elf III
00001850

Fire Elf IV
00001851

Fire Elf V
00001852

Death Fairy 
00001853

Death Fairy II
00001854

Death Fairy III
00001855

Death Fairy IV
00001856

Death Fairy V
00001857

Myth Rat Thief
00001858

Myth Rat Thief II
00001859

Myth Rat Thief III
00001860

Myth Rat Thief IV
00001861

Myth Rat Thief V
00001862

Life Draconian
00001863

Life Draconian II
00001864

Life Draconian III 
00001865

Life Draconian IV
00001866

Life Draconian V
00001867

Beastmoon Hunter
00001868

Beastmoon Warrior
00001869

Finish 25 Matches
00001870

Beastmoon Hoplite
00001871

Win 10 Matches
00001872

Beastmoon Myrmidon
00001873

Win 25 Match
00001874

Beastmoon Centurion
00001875

Win 50 Matches
00001876

Beastmoon Champion
00001877

Win 100 Matches
00001878

Win 175 Matches
00001879

Beastmoon Conqueror
00001880

Win 250 Matches
00001881

Beastmoon Warlord
00001882

Win 500 Matches
00001883

Beastmoon Legionnaire
00001884

Beastmoon Hero
00001885

Win 25 Matches
00001886

Win 1000 Matches
00001887

Balance Cyclops II
00001888

Fire Minotaur II
00001889

Dramaturgist
00001890

Dramaturgist
00001899

Death Cyclops
00001900

Death Cyclops
00001901

Death Cyclops II
00001902

Death Cyclops II
00001903

Death Cyclops III
00001904

Death Cyclops III
00001905

Death Cyclops IV
00001906

Death Cyclops IV
00001907

Death Cyclops V
00001908

Death Cyclops V
00001909

Life Colossus
00001910

Life Colossus
00001911

Life Colossus II
00001912

Life Colossus II
00001913

Life Colossus III
00001914

Life Colossus IV
00001915

Life Colossus IV
00001916

Life Colossus V
00001917

Life Colossus V
00001918

Balance Wolf Warrior
00001919

Balance Wolf Warrior
00001920

Balance Wolf Warrior II
00001921

Balance Wolf Warrior II
00001922

Balance Wolf Warrior III
00001923

Balance Wolf Warrior III
00001924

Balance Wolf Warrior IV
00001925

Balance Wolf Warrior IV
00001926

Balance Wolf Warrior V
00001927

Balance Wolf Warrior V
00001928

Myth Minotaur
00001929

Myth Minotaur
00001930

Myth Minotaur II
00001931

Myth Minotaur II
00001932

Myth Minotaur III
00001933

Myth Minotaur III
00001934

Myth Minotaur IV
00001935

Myth Minotaur IV
00001936

Myth Minotaur V
00001937

Myth Minotaur V
00001938

Myth Draconian
00001939

Myth Draconian
00001940

Myth Draconian II
00001941

Myth Draconian II
00001942

Myth Draconian III
00001943

Myth Draconian III
00001944

Myth Draconian IV
00001945

Myth Draconian IV
00001946

Myth Draconian V
00001947

Myth Draconian V
00001948

Storm Krokomummy
00001949

Storm Krokomummy
00001950

Storm Krokomummy II
00001951

Storm Krokomummy II
00001952

Storm Krokomummy III
00001953

Storm Krokomummy III
00001954

Storm Krokomummy IV
00001955

Storm Krokomummy IV
00001956

Storm Krokomummy V
00001957

Storm Krokomummy V
00001958

Fire Ninja Pig
00001959

Fire Ninja Pig
00001960

Fire Ninja Pig II
00001961

Fire Ninja Pig II
00001962

Fire Ninja Pig III
00001963

Fire Ninja Pig III
00001964

Fire Ninja Pig IV
00001965

Fire Ninja Pig V
00001966

Fire Ninja Pig V
00001967

Storm Rat Thief
00001968

Storm Rat Thief
00001969

Storm Rat Thief II
00001970

Storm Rat Thief II
00001971

Storm Rat Thief III
00001972

Storm Rat Thief III
00001973

Storm Rat Thief IV
00001974

Storm Rat Thief IV
00001975

Storm Rat Thief V
00001976

Storm Rat Thief V
00001977

Ice Elf
00001978

Ice Elf
00001979

Ice Elf II
00001980

Ice Elf II
00001981

Ice Elf III
00001982

Ice Elf III
00001983

Ice Elf IV
00001984

Ice Elf IV
00001985

Ice Elf V
00001986

Ice Elf V
00001987

Balance Fairy
00001988

Balance Fairy
00001989

Balance Fairy II
00001990

Balance Fairy II
00001991

Balance Fairy III
00001992

Balance Fairy III
00001993

Balance Fairy IV
00001994

Balance Fairy IV
00001995

Balance Fairy V
00001996

Balance Fairy V
00001997

Fire Deckathalon Champion
00001998

1st Place Fire Deckathlete
00001999

Ice Deckathalon Champion
00002000

1st Place Ice Deckathlete
00002001

Storm Deckathalon Champion
00002002

1st Place Storm Deckathlete
00002003

Myth Deckathalon Champion
00002004

1st Place Myth Deckathlete
00002005

Life Deckathalon Champion
00002006

1st Place Life Deckathlete
00002007

Death Deckathalon Champion
00002008

1st Place Death Deckathlete
00002009

Balance Deckathalon Champion
00002010

1st Place Balance Deckathlete
00002011

Fire Deckathalon Honoree
00002012

Top 100 Fire Deckathlete
00002013

Ice Deckathalon Honoree
00002014

Top 100 Ice Deckathlete
00002015

Storm Deckathalon Honoree
00002016

Top 100 Storm Deckathlete
00002017

Myth Deckathalon Honoree
00002018

Top 100 Myth Deckathlete
00002019

Life Deckathalon Honoree
00002020

Top 100 Life Deckathlete
00002021

Death Deckathalon Honoree
00002022

Top 100 Death Deckathlete
00002023

Balance Deckathalon Honoree
00002024

Top 100 Balance Deckathlete
00002025

Dug Doug
00002026

Rescue Doug
00002027

Took Out the Trash
00002028

Defeat King Detritus
00002029

Greggors' Grief
00002030

Defeat Old and Young Greggor
00002031

Memory Eraser
00002032

Defeat Viggor
00002033

Hargrove's Hero
00002034

Defeat Viggor's Drake
00002035

Renegade Wrangler
00002036

Defeat Renegade Druid
00002037

Smasharilith
00002038

Defeat Satharilith
00002039

The Undevoured
00002040

Defeat the Devourer
00002041

Photomonger
00002042

Better Halls & Crystals
00002043

Doomsday De-bunker
00002044

Defeating a Dead Horse
00002045

Trash Taker
00002046

Defeat Trash Monster x10
00002047

Trash Collector
00002048

Defeat Trash Monster x50
00002049

Trash Compactor
00002050

Defeat Trash Monster x100
00002051

Villain of the Vanguard
00002052

Defeat DS Vanguard x10
00002053

Vanguard Victor
00002054

Defeat DS Vanguard x50
00002055

Vanguard Vanquisher
00002056

Defeat DS Vanguard x100
00002057

Castle Inspector
00002058

Rate Castles
00002059

Team MVP
00002060

Life Fairy
00002061

Life Fairy II
00002062

Life Fairy III
00002063

Life Fairy IV
00002064

Life Fairy V
00002065

Fellspawn Bane
00002066

No one is defeated against Fellspawn
00002067

Fellspawn Striker
00002068

Defeat Fellspawn in under 3 rounds
00002069

Fellspawn Adversary
00002070

Cast no blades or traps against Fellspawn
00002071

Fellspawn Foe
00002072

Fellspawn's Nightmare
00002073

Team remains high HP against Fellspawn
00002074

Solo the Fellspawn
00002075

Fellspawn Master
00002076

Complete Fellspawn Badges
00002077

Promotions Associate
00002078

Associate Delivery Person
00002079

Mussel Head
00002080

Collect 100 Time Clams
00002081

So Shellfish
00002082

Collect 100 Coin Clams
00002083

Mighty Mayhemist
00002084

Defeat a Rank 1 Boss in Monster Mayhem
00002085

Marvelous Mayhemist
00002086

Defeat a Rank 2 Boss in Monster Mayhem
00002087

Magnificent Mayhemist
00002088

Win a Monster Mayhem Event
00002089

Maximal Mayhemist
00002090

Win 10 Monster Mayhem Events
00002091

Master of Mayhem
00002092

Win 100 Monster Mayhem Events
00002093

Coin Clams
00002094

Time Clams
00002095

Monster Mayhem Events
00002096

Monster Mayhem Events
00002097

Storm Elf
00002098

Storm Elf
00002099

Storm Elf II
00002100

Storm Elf II
00002101

Storm Elf III
00002102

Storm Elf V
00002103

Storm Elf IV
00002104

Storm Elf V
00002105

Death Rat
00002106

Death Rat
00002107

Death Rat II
00002108

Death Rat II
00002109

Death Rat III
00002110

Death Rat III
00002111

Death Rat IV
00002112

Death Rat IV
00002113

Death Rat V
00002114

Death Rat V
00002115

Storm Elf III
00002116

Storm Elf IV
00002117

Castle Tourist
00002118

Rated Castles
00002119

Castle Inspector
00002120

Castle Auditor
00002121

Castle Assesor
00002122

Master Decorator
00002123

Top Decorator
00002124

Magical Decorator
00002125

Crazy Decorator
00002126

A-Maze-ing Decorator
00002127

Seasonal Decorator
00002128

Dorm Decorator
00002129

Gauntlet Decorator
00002130

Collection Decorator
00002131

Ice Wolf Warrior
00002132

Ice Wolf Warrior II
00002133

Ice Wolf Warrior III
00002134

Ice Wolf Warrior IV
00002135

Ice Wolf Warrior V
00002136

Fire Colossus
00002137

Fire Colossus II
00002138

Fire Colossus III
00002139

Fire Colossus IV
00002140

Fire Colossus V
00002141

Balance Krokomummy
00002142

Balance Krokomummy
00002143

Balance Krokomummy II
00002144

Balance Krokomummy II
00002145

Balance Krokomummy III
00002146

Balance Krokomummy III
00002147

Balance Krokomummy IV
00002148

Balance Krokomummy IV
00002149

Balance Krokomummy V
00002150

Balance Krokomummy V
00002151

Defeat Copy Qhat in under 2 rounds
00002152

Quick Qhat
00002153

One Against Many
00002154

Solo Copy Qhat
00002155

TBD Count Copy Qhat
00002156

Have 5 Moon School Copy Qhats in Combat
00002157

Copy Qhat Copier
00002158

Defeat Copy Qhat with 4 Wizards from the same School
00002159

Took A Bite Out of Crime
00002160

Solo Jamburglar in 3 rounds or less
00002161

Drawless Victory
00002162

Defeat Jamburglar without casting Damage Spells
00002163

Chicken Scratcher
00002164

Solo Quake Charmer
00002165

Quaker G.O.A.T.
00002166

Defeat Quake Charmer with Rank 1 or less spells
00002167

Charmed the Charmer
00002168

Each Wizard has a Charm at the end of every round
00002169

Quake-Proof
00002170

Each Wizard has a Ward at the end of every round
00002171

Soledozer
00002172

Solo The Bundozer
00002173

Aura Endura
00002174

Defeat The Bundozer with each Wizard having an Aura active at the end of every round
00002175

The Undozer
00002176

Defeat The Bundozer surviving 3 charge hits without suffering a late penalty
00002177

1 n' 100
00002178

Defeat The Bundozer with a teammate at Full HP and another at 1% or less
00002179

Pets Lent
00002180

Mano a Muggo
00002181

Solo & Defeat Treemugger on Round 14
00002182

Pip Popper
00002183

Have an active full team with 0 pips at the moment Treemugger is Defeated
00002184

Solo Burner
00002185

Solo Heidi without a Minion sacrificing itself
00002186

Forged in Fire
00002187

Defeat Heidi after she activites her +100% Damage Aura
00002188

Carroted Artillery
00002189

Defeat Judge Veg Solo if Baby Carrot was your first Polymorph
00002190

Beet the Rap
00002191

Defeat Judge Veg Solo if Dead Beet was your first Polymorph
00002192

Disparagus Defendant
00002193

Defeat Judge Veg Solo if Disparagus was your first Polymorph
00002194

Pod of War
00002195

Defeat Judge Veg Solo if Snow Peas was your first Polymorph
00002196

Vegetable Medley
00002197

Defeat Judge Veg with all 4 forms active
00002198

Index Finger Of Justice
00002199

Defeat Boogie Bogeys Solo
00002200

Booger Boxer
00002201

Defeat Boogie Bogeys without casting an AOE/Divided target spell
00002202

Mucus Magus
00002203

Defeat Boogie Bogeys within 4 rounds
00002204

Clean Hands Club
00002205

Have 4 Wizards all with active absorbs, damage reductions shields & damage reduction auras at the start of any round
00002206

Karamelle Explorer
00002207

Complete the quest "Bittersweet Lemon-Heads"
00002208

Complete the quest "Pucker up, Peanut Buttercup"
00002209

Darn Skippy
00002210

Qhat of all Trades
00002211

Clock Puppet
00002212

Collect 100 Clockfather Flowers
00002213

Clockfathers
00002214

Life Minotaur
00002215

Life Minotaur II
00002216

Life Minotaur III
00002217

Life Minotaur IV
00002218

Life Minotaur V
00002219

Myth Ninja Pig
00002220

Myth Ninja Pig II
00002221

Myth Ninja Pig III
00002222

Myth Ninja Pig IV
00002223

Myth Ninja Pig V
00002224

Defeat 100 McCoil Brothers
00002225

McCoil
00002226

Temp:10 McCoil
00002227

Temp:100 McCoil
00002228

Temp:10 Roaster
00002229

Defeat 10 Rooster's Roasters
00002230

Roaster
00002231

Temp:100 Roaster
00002232

Defeat 100 Rooster's Roasters
00002233

Defeat 10 McCoil Brothers
00002234

Temp:10 Filly
00002235

Defeat 10 Felonious Fillies
00002236

Filly
00002237

Temp:100 Filly
00002238

Defeat 100 Felonious Fillies
00002239

Temp:10 Buffalo
00002240

Defeat 10 Buffalo Wings
00002241

Buffalo
00002242

Temp:100 Buffalo
00002243

Defeat 100 Buffalo Wings
00002244

Temp:10 Train_Boss
00002245

Defeat 10 Train Bosses
00002246

Train_Boss
00002247

Temp:100 Train_Boss
00002248

Defeat 100 Train Bosses
00002249

Train_Boss
00002250

The Law 'Round These Parts
00002251

Defeat Mulleted Dr. Neaux
00002252

Desperately Seeking Lemuria
00002253

Complete AR-PreLM-MAIN-001
00002254

Dependable Deputy
00002255

Kenny's Roosters Roaster
00002256

McCoil Foiler
00002257

Charm School Graduate
00002258

Buffalo Wing Clipper
00002259

Super Sheriff
00002260

Roaster with the Moster
00002261

McCoil Spoiler
00002262

Charm School Valedictorian
00002263

Buffalo Wing Dunker
00002264

Death Draconian V
00002265

Death Draconian IV
00002266

Death Draconian III
00002267

Death Draconian II
00002268

Death Draconian
00002269

Fire Cyclops V
00002270

Fire Cyclops IV
00002271

Fire Cyclops
00002272

Fire Cyclops II
00002273

Fire Cyclops III
00002274

Ice Fairy
00002275

Ice Fairy II
00002276

Ice Fairy III
00002277

Ice Fairy IV
00002278

Ice Fairy V
00002279

Myth Wolf Warrior
00002280

Myth Wolf Warrior
00002281

Myth Wolf Warrior II
00002282

Myth Wolf Warrior III
00002283

Myth Wolf Warrior IV
00002284

Myth Wolf Warrior V
00002285

Myth Wolf Warrior V
00002286

Myth Wolf Warrior IV
00002287

Myth Wolf Warrior III
00002288

Myth Wolf Warrior II
00002289

Balance Rat Thief
00002290

Balance Rat Thief
00002291

Balance Rat Thief II
00002292

Balance Rat Thief II
00002293

Balance Rat Thief III
00002294

Balance Rat Thief III
00002295

Balance Rat Thief IV
00002296

Balance Rat Thief IV
00002297

Balance Rat Thief V
00002298

Balance Rat Thief V
00002299

Storm Colossus
00002300

Storm Colossus
00002301

Storm Colossus II
00002302

Storm Colossus III
00002303

Storm Colossus III
00002304

Storm Colossus IV
00002305

Storm Colossus IV
00002306

Storm Colossus V
00002307

Storm Colossus V
00002308

Life Elf
00002309

Life Elf
00002310

Life Elf II
00002311

Life Elf II
00002312

Life Elf III
00002313

Life Elf III
00002314

Life Elf IV
00002315

Life Elf IV
00002316

Life Elf V
00002317

Life Elf V
00002318

Ice Minotaur
00002319

Ice Minotaur
00002320

Ice Minotaur II
00002321

Ice Minotaur II
00002322

Ice Minotaur III
00002323

Ice Minotaur III
00002324

Ice Minotaur IV
00002325

Ice Minotaur IV
00002326

Ice Minotaur V
00002327

Ice Minotaur V
00002328

Senior Arcanum Liaison
00002329

Complete the quest "Small World After All"
00002330

vs. the Volcano
00002331

Complete the quest "Bald-Faced Truth"
00002332

Knight of the Living Dead
00002333

Complete the quest "Solomon Joins the Party"
00002334

Mighty as a Mander
00002335

Complete the quest "The Fane of the Ancient One"
00002336

Wizard of Tomorrow
00002337

Complete the quest "Down to Earth Again"
00002338

Spiral's Greatest Detective
00002339

Complete the quest "Peace Meal"
00002340

Accomplished... Something
00002341

Complete the quest "The Next Thing"
00002342

Hero of Heroes
00002343

Complete the quest "Heroes Don't Grow on Trees"
00002344

Lemurian Explorer
00002345

Complete the quest "Night Flight In the Light"
00002346

Agent of Skeletaur
00002347

Complete the quest "Villain For Hire"
00002348

Newest Koolakamba
00002349

Complete the quest "On Your Feat"
00002350

Fossa Fighter
00002351

Fossa Spiter
00002352

Fossa Smiter
00002353

Boarbarian Clasher
00002354

Boarbarian Smasher
00002355

Boarbarian Basher
00002356

Kit-10 Error
00002357

Kit-10 Crasher
00002358

Mew Screen of Death
00002359

Bad Neighbor
00002360

Worse Neighbor
00002361

The Worst Neighbor
00002362

Crimefighter
00002363

Scheme Foiler
00002364

Gangbuster
00002365

Regular Irregulator
00002366

Highly Irregulator
00002367

Extremely Irregulator
00002368

Humango Pruner
00002369

Humango Masher
00002370

Humango Mulcher
00002371

Koolakombatant
00002372

Super Koolakombatant
00002373

Koolest Kombatant
00002374

Complete the quest "Villain For Hire"
00002375

Death Krokomummy
00002376

Death Krokomummy II
00002377

Death Krokomummy III
00002378

Death Krokomummy IV
00002379

Death Krokomummy V
00002380

Fire Draconian V
00002381

Fire Draconian
00002382

Fire Draconian II
00002383

Fire Draconian III
00002384

Fire Draconian IV
00002387

Sorcerer
00002388

Necromancer
00002389

Pyromancer
00002390

Thaumaturge
00002391

Theurgist
00002392

Conjurer
00002393

Diviner
00002394

Storm Ninja Pig
00002395

Storm Ninja Pig II
00002396

Storm Ninja Pig III
00002397

Storm Ninja Pig IV
00002398

Storm Ninja Pig V
00002399

Life Cyclops
00002400

Life Cyclops II
00002401

Life Cyclops III
00002402

Life Cyclops IV
00002403

Life Cyclops V
00002404

Myth Fairy
00002405

Myth Fairy II
00002406

Myth Fairy III
00002407

Myth Fairy IV
00002408

Myth Fairy V
00002409

Azoth Acquirer
00002410

Discover Azoth
00002411

Raid Finished
00002412

Raid Rookie
00002413

The Nullifier
00002414

The Nullifierer
00002415

The Nullifierest
00002416

Soldier of Moosefortune
00002417

Star Seeker
00002418

Collect 10 Power Stars
00002419

Star Warrior
00002420

Collect 100 Power Stars
00002421

Star Lord
00002422

Collect 1000 Power Stars
00002423

Manamana
00002424

Activate the Mana Chest 3 times
00002425

Health Hound
00002426

Dance Revolutionary
00002427

Milligetter
00002428

Soldier of Misfortune
00002429

Pet Detective
00002430

1% of the 1% 
00002431

Superior Support
00002432

Fail Forward Faster
00002433

Defeat 10 non boss monsters
00002434

Myth Colossus
00002435

Myth Colossus II
00002436

Myth Colossus III
00002437

Myth Colossus IV
00002438

Myth Colossus V
00002439

Ice Draconian
00002440

Ice Draconian II
00002441

Ice Draconian III
00002442

Ice Draconian IV
00002443

Ice Draconian V
00002444

Balance Minotaur
00002445

Balance Minotaur II
00002446

Balance Minotaur III
00002447

Balance Minotaur IV
00002448

Balance Minotaur V
00002449

Fire Rat Thief
00002450

Fire Rat Thief II
00002451

Fire Rat Thief III
00002452

Fire Rat Thief IV
00002453

Fire Rat Thief V
00002454

Death Wolf Warrior
00002455

Death Wolf Warrior II
00002456

Death Wolf Warrior III
00002457

Death Wolf Warrior IV
00002458

Death Wolf Warrior V
00002459

Arcanum Executive Liaison
00002460

Savior of the Sacred Yarn
00002461

Friend to Monkey & Unicorn
00002462

Let Slip Up the Dogs of War
00002463

Warrior of Heaven
00002464

Bringer of Fish
00002465

Market Manipulator
00002466

For Queen and Skyway
00002467

Ender of an Aeon
00002468

Novus Explorer
00002469

Toad Runner
00002470

Slapped the Iron Face
00002471

Wielder of Pips and Cards
00002472

Irk Shirker
00002473

Irk Berserker
00002474

Irk Scourger
00002475

Megrim Portent
00002476

Megrim Reaper
00002477

Megrim Fandango
00002478

Falcon Barber
00002479

Falcon Stylist
00002480

Falcon Artisan
00002481

Banana-Fana-Foe
00002482

Banana-Fana-Pro
00002483

Banana-Fana-Tastic
00002484

Golden Horde Warrior
00002485

Golden Horde Champion
00002486

Golden Horde Overlord
00002487

Non-Boss Monsters
00002488

Misfortunes Collected
00002489

Life Krokomummy
00002490

Life Krokomummy II
00002491

Life Krokomummy III
00002492

Life Krokomummy IV
00002493

Life Krokomummy V
00002494

Death Elf
00002495

Death Elf II
00002496

Death Elf III
00002497

Death Elf IV
00002498

Death Elf V
00002499

Stitch Stylist
00002500

Stitch Trendsetter
00002501

Stitch Fashionista
00002502

Stitch Fashion Icon
00002503

Night Mire Hair Tamer
00002504

Night Mire Hair Razer
00002505

Night Mire End Splitter
00002506

Defeat Mulleted Dr. Neaux 25 Times
00002507

Defeat Mulleted Dr. Neaux 50 Times
00002508

Raid Drums
00002509

Mullets Cut
00002510

Storm Minotaur
00002511

Storm Minotaur II
00002512

Storm Minotaur III
00002513

Storm Minotaur IV
00002514

Storm Minotaur V
00002515

Balance Ninja Pig
00002516

Balance Ninja Pig II
00002517

Balance Ninja Pig III
00002518

Balance Ninja Pig IV
00002519

Balance Ninja Pig V
00002520

Ice Cyclops
00002521

Ice Cyclops II
00002522

Ice Cyclops III
00002523

Ice Cyclops IV
00002524

Ice Cyclops V
00002525

Revenant Revealer
00002526

Challenger of Death
00002527

Ender of Death
00002528

Conqueror of Death
00002529

Vanquisher of Death
00002530

Gatekeeper of the Apocalypse
00002531

Death Rasp Defier
00002532

Death Silencer
00002533

Crusher of the Cometborn
00002534

Foe of the Cometborn
00002535

Yetaxa Shapeshifter
00002536

Ixta Imposter
00002537

Cameca Masquerader
00002538

Autloc Pretender
00002539

Delayer of Death's Plan
00002540

Unraveller of Death's Plan
00002541

Destroyer of Death's Plan
00002542

Did Not Pass Go
00002543

Wisp Fisher
00002544

Angler of Death
00002545

Seer of the Unseen
00002546

Death Drummer
00002547

Hunhau Defeats
00002548

Crying Sky Aztecans
00002549

Tokens Revealed
00002550

Ixta Drums
00002551

Fish N' Wisps
00002552

Fish Heads
00002553

Mega Meduelist
00002554

Titan Toppler
00002555

The Superest Hero
EarnedBadgePopup
Popup message when badge becomes wearable
Badge Earned:  #1:$BADGE_NAME$
Gardener01

Novice Gardener
Gardener02

Neophyte Gardener
Gardener03

Apprentice Gardener
Gardener04

Initiate Gardener
Gardener05

Intermediate Gardener
Gardener06

Journeyman Gardener
Gardener07

Expert Gardener
Gardener08

Adept Gardener
Gardener09

Master Gardener
Gardener10

Grandmaster Gardener
Gardener11


Gardener12


Gardener13


Gardener14


Gardener15

Legendary Gardener
Gardener16

Legendary Gardener
Gardener17

Legendary Gardener
Gardener18

Legendary Gardener
Gardener19

Legendary Gardener
Gardener20

Verdant Gardener
Legendary Artisan

Legendary Artisan
NewBadgePopup
Popup message when player finds out about a new badge
Badge Discovered: #1:$BADGE_NAME$
NoBadgeProgress
Progress information shown about unknown badge
??? ??? ???
NoBadgeTitle
Label on a badge button indicating that there will be no title displayed
No Title
